; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 473671 2 1 4 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image3 - mode
	infrared0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	Star0 - direction
	Star1 - direction
	Star4 - direction
	Star2 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 image3)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon6 spectrograph2)
	(have_image Star7 image3)
	(have_image Planet8 infrared0)
	(have_image Planet9 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 star7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star7)
   goals met: 0 of 6
4. (turn_to satellite0 star2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 groundstation3 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 6
7. (turn_to satellite0 planet9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet9)
   goals met: 0 of 6
8. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 6
9. (take_image satellite0 planet9 instrument0 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 1 of 6
10. (turn_to satellite1 star7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star7)
   goals met: 1 of 6
11. (turn_to satellite0 groundstation3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 6
12. (take_image satellite1 star7 instrument1 image3)
   added: (have_image star7 image3)
   goals met: 3 of 6
13. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 3 of 6
14. (take_image satellite1 planet8 instrument1 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 4 of 6
15. (turn_to satellite1 phenomenon6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 6
16. (take_image satellite1 phenomenon6 instrument1 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 5 of 6
17. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   goals met: 5 of 6
18. (take_image satellite1 phenomenon5 instrument1 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 6 of 6
